package section07;
/*
 * OOP (Object Oriented Programming)
 *  - 객체 지향 프로그래밍
 *  - 프로그램을 작성할 때 데이터와 데이터를 조작하는 메소드를 하나의 논리적 단위인 객체로 묶는 방식
 *  
 * 객체(Object)
 *  - 물리적으로 존재하거나 추상적으로 생각할 수 있는 것
 *  - 정의 가능하고 식별 가능하다
 *  - 속성(변수)과 기능(메소드)으로 구성되어 있다.
 * 
 *  예) 물리적인 객체 - 실존하는 모든것
 *     추상적인 객체 - 주문, 생산정보, 회계장부 등 
 *     
 * 객체 구성요소
 *  1) 속성
 *  2) 기능
 *  
 *  예) 티모 객체
 *  	속성 1) 체력 - 500
 *          2) 공격력 - 10
 *          3) 방어력 - 5
 *      기능 1) 실명 
 *      	2) 신속
 * 
 */
public class OOP01 {

}
